<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="日志," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="#1.&amp;#x4ED6;&amp;#x4EEC;&amp;#x4E0D;&amp;#x4F1A;&amp;#x8BA9;&amp;#x81EA;&amp;#x5DF1;&amp;#x8FC7;&amp;#x53BB;&amp;#x7684;&amp;#x9519;&amp;#x8BEF;&amp;#x5E72;&amp;#x6270;&amp;#x4ED6;&amp;#x4EEC;&amp;#x4ECA;&amp;#x5929;&amp;#x7684;&amp;#x751F;&amp;#x6D3B;&amp;#x3002;
&amp;#x806A;&amp;#x660E;&amp;#x4">
<meta property="og:type" content="article">
<meta property="og:title" content="日志">
<meta property="og:url" content="http://murainy.github.io/2016/07/05/title/index.html">
<meta property="og:site_name" content="Hexo Github">
<meta property="og:description" content="#1.&amp;#x4ED6;&amp;#x4EEC;&amp;#x4E0D;&amp;#x4F1A;&amp;#x8BA9;&amp;#x81EA;&amp;#x5DF1;&amp;#x8FC7;&amp;#x53BB;&amp;#x7684;&amp;#x9519;&amp;#x8BEF;&amp;#x5E72;&amp;#x6270;&amp;#x4ED6;&amp;#x4EEC;&amp;#x4ECA;&amp;#x5929;&amp;#x7684;&amp;#x751F;&amp;#x6D3B;&amp;#x3002;
&amp;#x806A;&amp;#x660E;&amp;#x4">
<meta property="og:updated_time" content="2016-07-04T13:00:59.317Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="日志">
<meta name="twitter:description" content="#1.&amp;#x4ED6;&amp;#x4EEC;&amp;#x4E0D;&amp;#x4F1A;&amp;#x8BA9;&amp;#x81EA;&amp;#x5DF1;&amp;#x8FC7;&amp;#x53BB;&amp;#x7684;&amp;#x9519;&amp;#x8BEF;&amp;#x5E72;&amp;#x6270;&amp;#x4ED6;&amp;#x4EEC;&amp;#x4ECA;&amp;#x5929;&amp;#x7684;&amp;#x751F;&amp;#x6D3B;&amp;#x3002;
&amp;#x806A;&amp;#x660E;&amp;#x4">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://murainy.github.io/2016/07/05/title/"/>

  <title> 日志 | Hexo Github </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Hexo Github</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">天马行空</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="#" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                日志
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-07-05T03:37:35+08:00" content="2016-07-04">
              2016-07-04
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/日志/" itemprop="url" rel="index">
                    <span itemprop="name">日志</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>#1.&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x8BA9;&#x81EA;&#x5DF1;&#x8FC7;&#x53BB;&#x7684;&#x9519;&#x8BEF;&#x5E72;&#x6270;&#x4ED6;&#x4EEC;&#x4ECA;&#x5929;&#x7684;&#x751F;&#x6D3B;&#x3002;</p>
<p>&#x806A;&#x660E;&#x4EBA;&#x786E;&#x4FE1;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x5931;&#x8D25;&#x548C;&#x9519;&#x8BEF;&#xFF0C;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x53D6;&#x5F97;&#x4EFB;&#x4F55;&#x6210;&#x529F;&#x3002;&#x8FD9;&#x4E9B;&#x5931;&#x8D25;&#x5F88;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x4ED6;&#x4EEC;&#x8FBE;&#x6210;&#x76EE;&#x6807;&#x7684;&#x969C;&#x788D;&#x3002;&#x4ED6;&#x4EEC;&#x4ECE;&#x4E0D;&#x8BA9;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x53D1;&#x751F;&#x3002;&#x4ED6;&#x4EEC;&#x628A;&#x8FC7;&#x53BB;&#x7559;&#x5728;&#x4E86;&#x8EAB;&#x540E;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x6539;&#x53D8;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#xFF0C;&#x4F46;&#x5374;&#x80FD;&#x4ECE;&#x4E2D;&#x83B7;&#x53D6;&#x7ECF;&#x9A8C;&#x548C;&#x6559;&#x8BAD;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x770B;&#x4F5C;&#x4E00;&#x6B21;&#x81EA;&#x6211;&#x6210;&#x957F;&#x7684;&#x673A;&#x4F1A;&#x3002;</p>
<p>#2.&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x4E13;&#x6CE8;&#x4E8E;&#x8D1F;&#x9762;&#x6216;&#x6D88;&#x6781;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x806A;&#x660E;&#x4EBA;&#x76F8;&#x4FE1;&#xFF0C;&#x8FD9;&#x4E9B;&#x6D88;&#x6781;&#x6216;&#x8D1F;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x4E00;&#x79CD;&#x5BA2;&#x89C2;&#x5B58;&#x5728;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x5927;&#x8111;&#x5145;&#x6EE1;&#x8D1F;&#x9762;&#x4FE1;&#x606F;&#xFF0C;&#x4F60;&#x7684;&#x751F;&#x6D3B;&#x4E5F;&#x5C06;&#x5904;&#x4E8E;&#x6D88;&#x6781;&#x88AB;&#x52A8;&#x72B6;&#x6001;&#x3002;&#x806A;&#x660E;&#x4EBA;&#x77E5;&#x9053;&#xFF0C;&#x5F53;&#x4F60;&#x5C3D;&#x4F60;&#x6240;&#x80FD;&#xFF0C;&#x52AA;&#x529B;&#x5730;&#x68A6;&#x60F3;&#x3001;&#x521B;&#x9020;&#x3001;&#x6784;&#x5EFA;&#x3001;&#x601D;&#x7D22;&#x4EE5;&#x53CA;&#x70ED;&#x7231;&#x65F6;&#xFF0C;&#x4F60;&#x7684;&#x751F;&#x6D3B;&#x5C06;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x3002;</p>
<p>#3.&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x9003;&#x79BB;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x90FD;&#x66FE;&#x6709;&#x8FC7;&#xFF0C;&#x6B63;&#x5728;&#x6709;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x8981;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E5F;&#x8BB8;&#x4E0E;&#x5DE5;&#x4F5C;&#x3001;&#x94B1;&#x8D22;&#x3001;&#x5BB6;&#x5EAD;&#x3001;&#x5065;&#x5EB7;&#x3001;&#x7B49;&#x7B49;&#x76F8;&#x5173;&#x3002;&#x806A;&#x660E;&#x4EBA;&#x5C06;&#x9762;&#x5BF9;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x4EEC;&#x4E3A;&#x6B64;&#x5BFB;&#x627E;&#x6700;&#x4F73;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x5F53;&#x4ED6;&#x4EEC;&#x5931;&#x8D25;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x7AD9;&#x8D77;&#x6765;&#xFF0C;&#x7EE7;&#x7EED;&#x524D;&#x884C;&#x3002;&#x4ED6;&#x4EEC;&#x6709;&#x52C7;&#x6C14;&#x5BF9;&#x6297;&#x6050;&#x60E7;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x6BCF;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x770B;&#x4F5C;&#x4E00;&#x6B21;&#x81EA;&#x6211;&#x63D0;&#x5347;&#x7684;&#x673A;&#x4F1A;&#x3002;</p>
<p>#4.&#x4ED6;&#x4EEC;&#x4E0D;&#x5728;&#x610F;&#x5176;&#x4ED6;&#x4EBA;&#x5982;&#x4F55;&#x770B;&#x5F85;&#x4ED6;&#x4EEC;&#x3002;</p>
<p>&#x806A;&#x660E;&#x4EBA;&#x4E0D;&#x4F1A;&#x8BA9;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x6D88;&#x6781;&#x60C5;&#x7EEA;&#x5F71;&#x54CD;&#x4ED6;&#x4EEC;&#x5145;&#x6EE1;&#x5FEB;&#x4E50;&#x548C;&#x559C;&#x60A6;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0D;&#x7F3A;&#x5C11;&#x6124;&#x4E16;&#x5AC9;&#x4FD7;&#x5206;&#x5B50;&#x3001;&#x6000;&#x7591;&#x8BBA;&#x8005;&#x548C;&#x5FC3;&#x6000;&#x5992;&#x5FCC;&#x7684;&#x4EBA;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x806A;&#x660E;&#x4EBA;&#x4F1A;&#x8FDC;&#x79BB;&#x4ED6;&#x4EEC;&#x3002;&#x4ED6;&#x4EEC;&#x559C;&#x6B22;&#x4E0E;&#x90A3;&#x4E9B;&#x667A;&#x6167;&#x7684;&#x4EBA;&#x4E3A;&#x4F34; &#x2013; &#x4E00;&#x8D77;&#x5206;&#x4EAB;&#x5171;&#x540C;&#x7684;&#x5174;&#x8DA3;&#x548C;&#x4EF7;&#x503C;&#x89C2;&#x3002;&#x6709;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x601D;&#x60F3;&#x503C;&#x5F97;&#x4F60;&#x7559;&#x5FC3;&#x4E00;&#x4E0B;&#xFF1A;&#x5982;&#x679C;&#x5728;&#x4E00;&#x4E2A;&#x623F;&#x95F4;&#x91CC;&#xFF0C;&#x4F60;&#x662F;&#x6700;&#x806A;&#x660E;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x4E00;&#x5B9A;&#x6765;&#x9519;&#x4E86;&#x5730;&#x65B9;&#x3002;</p>
<p>#5.&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x806A;&#x660E;&#x4EBA;&#x4E0D;&#x4F1A;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;&#x4ED6;&#x4EEC;&#x901A;&#x8FC7;&#x57F9;&#x517B;&#x9AD8;&#x6548;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x5E2E;&#x52A9;&#x4ED6;&#x4EEC;&#x66F4;&#x597D;&#x66F4;&#x5FEB;&#x5730;&#x5DE5;&#x4F5C;&#x3002;&#x4ED6;&#x4EEC;&#x4E0D;&#x8BA9;&#x4EFB;&#x4F55;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x4E8B;&#x60C5;&#x53CA;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4EFB;&#x52A1;&#x6253;&#x6270;&#x548C;&#x5206;&#x6563;&#x4ED6;&#x4EEC;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x3002;&#x4ED6;&#x4EEC;&#x5F53;&#x7136;&#x77E5;&#x9053;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x4E0D;&#x53EF;&#x80FD;&#x603B;&#x662F;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EBA;&#x7684;&#x5927;&#x8111;&#x9700;&#x8981;&#x95F4;&#x6B47;&#x6027;&#x7684;&#x4F11;&#x606F;&#x3002;</p>
<p>#6.&#x4ED6;&#x4EEC;&#x4E0D;&#x671F;&#x5F85;&#x7ACB;&#x7AFF;&#x89C1;&#x5F71;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x806A;&#x660E;&#x4EBA;&#x77E5;&#x9053;&#xFF0C;&#x5E78;&#x8FD0;&#x6C38;&#x8FDC;&#x964D;&#x4E34;&#x5728;&#x90A3;&#x4E9B;&#x6709;&#x8010;&#x5FC3;&#xFF0C;&#x613F;&#x610F;&#x7B49;&#x5F85;&#x7684;&#x4EBA;&#x8EAB;&#x4E0A;&#x3002;&#x5728;&#x5F53;&#x4ECA;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x603B;&#x662F;&#x5E0C;&#x671B;&#x5728;&#x4E00;&#x5206;&#x949F;&#x4E4B;&#x5185;&#x5F97;&#x5230;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x5F97;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x806A;&#x660E;&#x4EBA;&#x6DF1;&#x77E5;&#xFF0C;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x51ED;&#x501F;&#x52AA;&#x529B;&#x65B9;&#x80FD;&#x83B7;&#x5F97;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F60;&#x53EA;&#x6709;&#x5728;&#x505A;&#x8FC7;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x771F;&#x6B63;&#x7406;&#x89E3;&#x4ED6;&#x4EEC;&#x3002;</p>
<p>#7.&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x5C06;&#x4E3B;&#x8981;&#x7CBE;&#x529B;&#x653E;&#x5728;&#x90A3;&#x4E9B;&#x4ED6;&#x4EEC;&#x4E0D;&#x53EF;&#x63A7;&#x5236;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#x3002;</p>
<p>&#x6BCF;&#x5929;&#x6211;&#x4EEC;&#x90FD;&#x5C06;&#x9762;&#x5BF9;&#x4E00;&#x4E9B;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5982;&#x4EA4;&#x901A;&#x5835;&#x585E;&#x3001;&#x7C97;&#x9C81;&#x65E0;&#x793C;&#x7684;&#x4EBA;&#x7B49;&#x7B49;&#x3002;&#x806A;&#x660E;&#x4EBA;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8D1F;&#x9762;&#x60C5;&#x7EEA;&#x4F1A;&#x4F24;&#x5BB3;&#x5230;&#x81EA;&#x5DF1;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BF9;&#x8FD9;&#x7C7B;&#x4E8B;&#x60C5;&#x52AA;&#x529B;&#x4FDD;&#x6301;&#x5E73;&#x9759;&#x3002;</p>
<p>#8.&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x628A;&#x65F6;&#x95F4;&#x6D6A;&#x8D39;&#x5728;&#x90A3;&#x4E9B;&#x4ECE;&#x4E0D;&#x9F13;&#x52B1;&#x4ED6;&#x4EEC;&#x7684;&#x4EBA;&#x8EAB;&#x4E0A;&#x3002;</p>
<p>&#x806A;&#x660E;&#x4EBA;&#x559C;&#x6B22;&#x4E0E;&#x806A;&#x660E;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x4ED6;&#x4EEC;&#x4E0E;&#x5BB6;&#x5EAD;&#x3001;&#x670B;&#x53CB;&#x4EE5;&#x53CA;&#x719F;&#x4EBA;&#x4E00;&#x8D77;&#x5206;&#x4EAB;&#x4ED6;&#x4EEC;&#x7684;&#x5174;&#x8DA3;&#x548C;&#x89C2;&#x70B9;&#x3002;&#x4ED6;&#x4EEC;&#x5F53;&#x7136;&#x77E5;&#x9053;&#xFF0C;&#x4ED6;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x82B1;&#x4E00;&#x70B9;&#x513F;&#x65F6;&#x95F4;&#x4E0E;&#x90A3;&#x4E9B;&#x5FC3;&#x6001;&#x6D88;&#x6781;&#x7684;&#x4EBA;&#x76F8;&#x5904;&#x3002;</p>
<p>#9.&#x4ED6;&#x4EEC;&#x4ECE;&#x4E0D;&#x9A84;&#x50B2;&#x81EA;&#x5927;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x5F88;&#x5C11;&#x542C;&#x5230;&#x806A;&#x660E;&#x4EBA;&#x8BF4;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x5F88;&#x806A;&#x660E;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x5F88;&#x5BB3;&#x7F9E;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x89C9;&#x5F97;&#x6709;&#x5FC5;&#x8981;&#x544A;&#x8BC9;&#x5168;&#x4E16;&#x754C;&#x4ED6;&#x4EEC;&#x975E;&#x5E38;&#x806A;&#x660E;&#x3002;&#x4ED6;&#x4EEC;&#x5F88;&#x5C11;&#x5938;&#x8000;&#x81EA;&#x5DF1;&#x7684;&#x6210;&#x5C31;&#x548C;&#x5956;&#x52B1;&#x3002;</p>
<p>#10.&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x5FD8;&#x8BB0;&#x8BF4;&#x201C;&#x8C22;&#x8C22;&#x4F60;&#xFF01;&#x201D;</p>
<p>&#x8868;&#x8FBE;&#x8C22;&#x610F;&#x662F;&#x4E00;&#x4EF6;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x806A;&#x660E;&#x4EBA;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5E76;&#x4E0D;&#x4EE5;&#x4ED6;&#x4EEC;&#x4E3A;&#x4E2D;&#x5FC3;&#x3002;&#x4ED6;&#x4EEC;&#x7B03;&#x4FE1;&#x5584;&#x826F;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x800C;&#x4E14;&#x4E00;&#x4E2A;&#x884C;&#x4E3A;&#x826F;&#x597D;&#x7684;&#x4E3E;&#x52A8;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x5728;&#x672A;&#x6765;&#x5C06;&#x7ED9;&#x4E88;&#x4ED6;&#x4EEC;&#x540C;&#x6837;&#x7684;&#x56DE;&#x62A5;&#x3002;</p>

      
    </div>

    <div>
      
        
<div id="wechat_subscriber" style="display: block； padding: 10px 0; margin: 20px auto; width: 100%; text-align: center">
    <img id="wechat_subscriber_qcode" src="/uploads/wechat-qcode.jpg" alt="Murainy wechat" style="width: 200px; max-width: 100%;"/>
    <div>欢迎您扫一扫上面的微信公众号，订阅我的博客！</div>
</div>

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/日志/" rel="tag">#日志</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/07/01/about/" rel="next" title="about">
                <i class="fa fa-chevron-left"></i> about
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/07/05/title-1/" rel="prev" title="日志">
                日志 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="Murainy" />
          <p class="site-author-name" itemprop="name">Murainy</p>
          <p class="site-description motion-element" itemprop="description">自己面朝大海，别处春暖花开</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">13</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">5</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">5</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Murainy</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';                
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });
                            
                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').mousedown(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>

  

  

  
<a href="https://murainy.github.io" target="_blank"><img style="position: absolute; top: 0; right: 0; border: 0;" src="/images/forkme.png" alt="Fork me on GitHub"></a>
</body>
</html>
